#include "Utils.h"
#pragma once

FVertexSimple box_vertices_black[] =
{
	{ -1.0f,  1.0f, 0.0f, 1.0f, 1.0f, 1.0f, 0.0f }, // аб╩С
	{  1.0f,  1.0f, 0.0f, 1.0f, 1.0f, 1.0f, 0.0f }, // ©Л╩С
	{ -1.0f, -1.0f, 0.0f, 1.0f, 1.0f, 1.0f, 0.0f }, // абго
	{ -1.0f, -1.0f, 0.0f, 1.0f, 1.0f, 1.0f, 0.0f }, // абго
	{  1.0f,  1.0f, 0.0f, 1.0f, 1.0f, 1.0f, 0.0f }, // ©Л╩С
	{  1.0f, -1.0f, 0.0f, 1.0f, 1.0f, 1.0f, 0.0f }  // ©Лго
};

FVertexSimple box_vertices_blue[] =
{
	{ -1.0f,  1.0f, 0.0f, 0.0f, 0.0f, 1.0f, 1.0f }, // аб╩С
	{  1.0f,  1.0f, 0.0f, 0.0f, 0.0f, 1.0f, 1.0f }, // ©Л╩С
	{ -1.0f, -1.0f, 0.0f, 0.0f, 0.0f, 1.0f, 1.0f }, // абго
	{ -1.0f, -1.0f, 0.0f, 0.0f, 0.0f, 1.0f, 1.0f }, // абго
	{  1.0f,  1.0f, 0.0f, 0.0f, 0.0f, 1.0f, 1.0f }, // ©Л╩С
	{  1.0f, -1.0f, 0.0f, 0.0f, 0.0f, 1.0f, 1.0f }  // ©Лго
};